{
    "endReached":"Je hebt het einde van deze sectie bereikt!",
    "continueToNext":"Ga door naar de volgende sectie:",
    "rememberToCheckPoints":"Je kunt je huidige punten controleren in de blauwe blob in de rechteronderhoek van de pagina.",
    "footer-src":"Broncode van het materiaal",
    "footer-edit-page":"Pagina bewerken",
    "footer-report-issue":"Probleem melden",
    "makers":"Deze cursus is gecreëerd door de Agile Education Research groep",
    "rage":"van de Universiteit van Helsinki",
    "credits":"Over het materiaal en zijn makers",
    "twitter-aria":"Mooc.fi Twitter-profiel",
    "facebook-aria":"Mooc.fi Facebook-profiel",
    "yourube-aria":"Mooc.fi YouTube-kanaal",
    "logout":"Afmelden",
    "newAccount":"Maak een nieuw account",
    "login":"Inloggen",
    "mailingListTitle":"Herinner me wanneer de cursus begint",
    "subscribe":"abonneren",
    "tableOfContents":"Inhoudsopgave",
    "sampleOutput":"Voorbeelduitvoer",
    "sampleData":"Voorbeeldgegevens",
    "loginToSeeExercise":"Log in om de oefening te bekijken",
    "loginToAttemptExercise":"Log in om de oefening te voltooien.",
    "pleaseLogin":"Je bent niet ingelogd. Sommige delen van het materiaal zijn alleen voor ingelogde gebruikers. Je kunt hier inloggen: ",
    "inThisSection":"In dit deel:" ,
    "programmingExercise":"Programmeer oefening:",
    "moodleExercise": "Moodle oefening:",
    "sqlTrainerExercise": "SQL-trainer oefening:",
    "points":"Punten",
    "submitNB":"NB: Sommige oefeningen hebben meerdere delen, en je kunt punten ontvangen voor de verschillende delen apart. Je kunt een gedeeltelijk voltooide oefening indienen door 'Oplossing indienen' te kiezen uit het menu naast de knop voor het uitvoeren van tests",
    "installationGuideLink":"",
    "submitHowTo":"",
    "loginForExercise":"Log in om de oefening te bekijken",
    "loginToSeeExercisePoints": "Log in om de oefenpunten te zien.",
    "submitNetBeans":"Dien uw oplossing in om te worden gecontroleerd op de server in de NetBeans programmeeromgeving: ",
    "seeSubmissions":"Je kunt je inzendingen zien in de Test My Code oefeninzendingsomgeving.",
    "here":"hier",
    "solutionHowTo":"Hoe de oplossing te bekijken",
    "coinSolutionHowTo":"Hoe de oplossing te bekijken voor het oplossen van de oefening",
    "noCoin":"In deze oefening kun je geen munt gebruiken om de oplossing te bekijken voor het indienen van de oefening.",
    "noCoinsOnCourse": "Je kunt de oplossing niet bekijken voor het voltooien van de oefening op deze cursus.",
    "modelSolutionUnavailableBecauseEmailNotVerified": "Verifieer alstublieft uw e-mailadres om oplossingen in te schakelen.",
    "whyCoin":"Je kunt de oplossing zien voor of na het indienen van de oefening. Als je de oplossing wilt zien voor het indienen van de oefening, moet je oplossingsmunten gebruiken.",
    "coinCost": "Een modeloplossing kost evenveel munten als de oefening punten waard is.",
    "usesCoinMultiplePoints": "kosten:",
    "usesCoinMultiplePoints2": "munten",
    "getNewCoin":"Je krijgt een nieuwe oplossingsmunt als je",
    "getNewCoin2":"oefeningen hebt ingediend. Je kunt munten gebruiken om oefenoplossingen te zien en jezelf uit de problemen te helpen.",
    "oneCoin":"Je hebt 1 munt",
    "howManyCoins":"Je hebt <1>{{count}}</1> munten.",
    "nocoins":"Je hebt nog geen munten.",
    "howCoins":"Je gebruikt alleen een munt als je op de knop klikt die zegt 'Gebruikt een munt' onder deze tekst. Je kunt de oplossing zien zonder een munt te gebruiken in de Test My Code service, hetzij in Netbeans of op de TMC-website na het voltooien en indienen van de relevante oefening.",
    "howSeeSolution":"Je kunt de oplossing zien in de Test My Code service, hetzij in TMCBeans of op de TMC-website na het voltooien van de relevante oefening.",
    "seeSolution":"Bekijk oplossing",
    "usesCoin":"Gebruikt een munt",
    "coinUsed":"Je hebt al een munt gebruikt voor deze oplossing",
    "update":"Bijwerken",
    "solution":"Oplossing",
    "exerciseList":"Lijst van oefeningen in dit deel",
    "unknownType":"Onbekend oefeningstype",
    "quiz":"Quiz",
    "loading":"Een sectie van de cursus laden...",
    "loginToSee":"Er is hier wat inhoud die alleen beschikbaar is voor ingelogde gebruikers. Log in om de inhoud te zien.",
    "errorInMaterial":"Kan dit gedeelte van het materiaal niet laden vanwege een fout: ",
    "incorrectMaterial":"Er is hier wat onjuist gedefinieerde inhoud. Reden: geen id.",
    "loggedInWith":"Je bent ingelogd als: ",
    "studentInfo":"Studenteninformatie",
    "aboutYourself":"Vertel ons over jezelf. Deze informatie helpt ons om cursuskredieten te registreren en de cursus te organiseren. Je kunt je informatie later bewerken in de cursusinstellingen. Na het invullen van je informatie, klik op 'Opslaan' onderaan de pagina.",
    "firstName":"Voornaam",
    "lastName":"Achternaam",
    "sid":"Studentnummer van de Universiteit van Helsinki",
    "nosid":"Laat leeg als je momenteel geen student bent aan de Universiteit van Helsinki.",
    "marketing":"Je mag me informatie sturen over nieuwe cursussen",
    "courseInfo": "Cursus informatie",
    "useCourseVariantLabel": "Ik neem deel aan een andere cursus dan een mooc.fi open cursus of een cursus van de Universiteit van Helsinki.",
    "courseVariant": "Cursusaanbieder",
    "chooseCourse": "Kies cursus",
    "researchTitle":"Onderzoeksthema's op deze cursus",
    "research1":"Gegevens van deze cursus worden gebruikt om het leren te bestuderen. Dit onderzoek heeft meerdere doelen: ",
    "research2":"Creëren van aanpasbaar cursusmateriaal, dat rekening houdt met de verschillen tussen studenten, en indien nodig meer geïndividualiseerd leermateriaal biedt.",
    "research3":"Onze kennis over leren in digitale omgevingen vergroten.",
    "research4":"Ondersteunen van andere partijen die werken met leermaterialen en leeronderzoek. Dit leidt vanzelfsprekend tot betere leerresultaten voor studenten.",
    "research5":"Als je geïnteresseerd bent in onderzoek naar leeranalyse, kun je meer leren uit het artikel ",
    "research6":"De onderzoeksgegevens van deze cursus worden beheerd door Matti Luukkainen van de Agile Education Research group aan de afdeling Informatica van de Universiteit van Helsinki. Je kunt op elk moment vragen om de verwijdering van de over jou verzamelde gegevens door een e-mail te sturen naar mooc@cs.helsinki.fi",
    "research7":"Gegevens verzameld op deze cursus worden gebruikt in onderzoek. De verzamelde gegevens bevatten informatie over het gebruik van het materiaal, het proces van het voltooien van oefeningen en gegevens verzameld uit examens. Als er onderzoek wordt gepubliceerd op basis van de gegevens, kan geen enkele individuele student worden geïdentificeerd uit de resultaten. Het weigeren om deel te nemen aan het onderzoek heeft geen negatieve gevolgen voor de cursusdeelnemer.",
    "researchAgree":"Deelnemen aan het onderzoek",
    "researchYes":"Ik zal deelnemen aan het onderzoek. Door deze optie te selecteren, help je huidige en toekomstige studenten.",
    "researchNo":"Ik zal niet deelnemen aan het onderzoek.",
    "save":"Opslaan",
    "fillRequired":"Vul de verplichte velden in.",
    "reportIssueTitle":"Hoe een probleem in het materiaal te melden",
    "reportIssueButtonText":"Nieuwe probleem aanmaken",
    "reportIssueSecondHeader":"Hoe het probleem samen te stellen",
    "reportIssue1":"Je kunt een fout die je hebt gevonden melden op het tabblad 'issues' van het Github-project van de cursus. Github is een service waar projecten, software en broncode kunnen worden beheerd en gedeeld met anderen.",
    "reportIssue2":"Het melden van een probleem vereist een Github-account. Als je nog geen account hebt, kun je deze aanmaken",
    "reportIssue3":"hier",
    "reportIssue4":"Before you open a new issue, please check",
    "reportIssue5":"for an already opened issue regarding the mistake you found.",
    "reportIssue6":"We might ask some clarifying questions if we are unable to fix the issue without your help. Github should send an email notification regarding these questions to the email address linked to your Github account.",
    "reportIssue7":"Thank you for helping us improve our materials!",
    "PageSecondHeader":"Hoe het wijzigingsvoorstel te sturen",
    "editPage1":"Je kunt een wijzigingsvoorstel sturen naar het Github-project van de cursus. Github is een service waar projecten, software en broncode kunnen worden beheerd en gedeeld met anderen.",
    "editPage2":"Het verzenden van een wijzigingsvoorstel vereist een Github-account. Als je nog geen account hebt, kun je deze aanmaken",
    "editPage3":"hier",
    "editPage4":"Controleer, voordat je jouw voorstel verzendt",
    "editPage5":"of iemand al dezelfde wijziging in het materiaal heeft voorgesteld.",
    "editPage6":"Bedankt voor je hulp om onze materialen te verbeteren!",
    "editPageList1":"Druk op de knop hierboven om de pagina te bewerken waar je zojuist was.",
    "editPageList2":"Schakel de verpakkingsstijl van \"Geen wrap\" --> \"Zachte wrap\" in de rechterbovenhoek van het bewerkingsvenster.",
    "editPageList3":"Zoek het gedeelte in het materiaal dat je wilt bewerken. Je kunt het juiste gedeelte zoeken door op Ctrl+f te drukken en een geschikte zoekterm te schrijven.",
    "editPageList4":"Scroll naar de onderkant van de pagina en schrijf een kort en informatief onderwerp in het veld \"Bestandswijziging voorstellen\", bijvoorbeeld \"Een typfout in Deel 2 corrigeren\".",
    "editPageList5":"Klik op de groene knop \"Bestandswijziging voorstellen\". Dit zou je moeten doorsturen naar een andere pagina.",
    "editPageList6":"Op de doorgestuurde pagina, klik op de knop \"Nieuwe Pull Request\".",
    "difficultyHeader": "Moeilijkheidsgraad: -",
    "difficultyHeader1": "Moeilijkheidsgraad: Makkelijk",
    "difficultyHeader2": "Moeilijkheidsgraad: Gemiddeld",
    "difficultyHeader3": "Moeilijkheidsgraad: Moeilijk"
    }

